; domain
(define (domain mytrajectoryconstraintsremover_minigrid_problem-domain)
 (:requirements :strips :typing :negative-preconditions :equality :conditional-effects :existential-preconditions :universal-preconditions :action-costs)
 (:types
    room objectordoor color - object
    object_ door - objectordoor
    empty_0 ball key - object_
 )
 (:constants
   empty - empty_0
   yellow_ball_1 - ball
   room_2 - room
 )
 (:predicates (agentinroom ?room - room) (objectinroom ?obj - object_ ?room - room) (objectcolor ?objectordoor - objectordoor ?color - color) (at_ ?objectordoor - objectordoor) (carrying ?obj - object_) (locked ?door - door) (adjacentrooms ?room1 - room ?room2 - room ?door - door) (blocked ?door - door ?obj - object_ ?room - room) (visited ?room - room) (emptyhands) (hold_0))
 (:functions (total-cost))
 (:action gotoobject
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (objectinroom ?obj ?room) (agentinroom ?room))
  :effect (and (at_ ?obj)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (increase (total-cost) 1)))
 (:action gotoempty
  :parameters ()
  :effect (and (at_ empty)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (increase (total-cost) 1)))
 (:action gotodoor
  :parameters ( ?door - door ?room1 - room ?room2 - room)
  :precondition (and (adjacentrooms ?room1 ?room2 ?door) (agentinroom ?room1) (forall (?o - object_)
 (not (blocked ?door ?o ?room1))))
  :effect (and (at_ ?door)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (increase (total-cost) 1)))
 (:action gotoroom
  :parameters ( ?room1 - room ?room2 - room ?door - door)
  :precondition (and (agentinroom ?room1) (adjacentrooms ?room1 ?room2 ?door) (not (locked ?door)))
  :effect (and (not (agentinroom ?room1)) (agentinroom ?room2) (visited ?room2)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (increase (total-cost) 1)))
 (:action pick
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (objectinroom ?obj ?room) (at_ ?obj) (emptyhands))
  :effect (and (not (at_ ?obj)) (not (emptyhands)) (carrying ?obj) (not (objectinroom ?obj ?room))(forall (?d - door) (when (blocked ?d ?obj ?room) (not (blocked ?d ?obj ?room)))) (when (and (objectinroom yellow_ball_1 room_2) (not (and (= ?obj yellow_ball_1) (= ?room room_2)))) (hold_0)) (increase (total-cost) 1)))
 (:action drop
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (carrying ?obj) (not (emptyhands)) (at_ empty))
  :effect (and (not (carrying ?obj)) (at_ ?obj) (not (at_ empty)) (emptyhands) (objectinroom ?obj ?room) (increase (total-cost) 1)))
 (:action toggle
  :parameters ( ?door - door)
  :precondition (and (at_ ?door))
  :effect (and (when (not (locked ?door)) (locked ?door)) (when (locked ?door) (not (locked ?door))) (increase (total-cost) 1)))
)

; problem
(define (problem mytrajectoryconstraintsremover_minigrid_problem-problem)
 (:domain mytrajectoryconstraintsremover_minigrid_problem-domain)
 (:objects
   room_1 room_3 room_4 - room
   redtype greentype bluetype yellowtype purpletype greytype - color
   blue_door_1 red_door_1 red_door_2 blue_door_2 - door
   grey_ball_1 - ball
   blue_key_3 red_key_3 blue_key_2 red_key_4 blue_key_1 red_key_1 blue_key_4 red_key_2 - key
 )
 (:init (agentinroom room_4) (objectinroom red_key_1 room_1) (objectinroom blue_key_1 room_1) (objectinroom blue_key_2 room_2) (objectinroom red_key_2 room_2) (objectinroom yellow_ball_1 room_3) (objectinroom blue_key_3 room_3) (objectinroom red_key_3 room_3) (objectinroom red_key_4 room_4) (objectinroom grey_ball_1 room_4) (objectinroom blue_key_4 room_4) (objectcolor red_key_1 redtype) (objectcolor blue_key_1 bluetype) (objectcolor blue_key_2 bluetype) (objectcolor red_key_2 redtype) (objectcolor yellow_ball_1 yellowtype) (objectcolor blue_key_3 bluetype) (objectcolor red_key_3 redtype) (objectcolor red_key_4 redtype) (objectcolor grey_ball_1 greytype) (objectcolor blue_key_4 bluetype) (objectcolor blue_door_1 bluetype) (objectcolor red_door_1 redtype) (objectcolor red_door_2 redtype) (objectcolor blue_door_2 bluetype) (emptyhands) (locked blue_door_1) (locked red_door_1) (locked red_door_2) (locked blue_door_2) (adjacentrooms room_2 room_1 blue_door_1) (adjacentrooms room_1 room_2 blue_door_1) (adjacentrooms room_3 room_1 red_door_1) (adjacentrooms room_1 room_3 red_door_1) (adjacentrooms room_4 room_2 red_door_2) (adjacentrooms room_2 room_4 red_door_2) (adjacentrooms room_4 room_3 blue_door_2) (adjacentrooms room_3 room_4 blue_door_2) (visited room_4) (= (total-cost) 0))
 (:goal (and (exists (?v - key)
 (and (objectcolor ?v bluetype) (objectinroom ?v room_1) (agentinroom room_1) (at_ ?v))) (hold_0)))
 (:metric minimize (total-cost))
)

; plan
1. (gotodoor blue_door_2 room_4 room_3)
   added: (at_ blue_door_2)
   goals met: 0 of 2
2. (toggle blue_door_2)
   deleted: (locked blue_door_2)
   goals met: 0 of 2
3. (gotoroom room_4 room_3 blue_door_2)
   deleted: (agentinroom room_4) (at_ blue_door_2)
   added: (agentinroom room_3) (visited room_3)
   goals met: 0 of 2
4. (gotodoor red_door_1 room_3 room_1)
   added: (at_ red_door_1)
   goals met: 0 of 2
5. (toggle red_door_1)
   deleted: (locked red_door_1)
   goals met: 0 of 2
6. (gotoobject yellow_ball_1 room_3)
   deleted: (at_ red_door_1)
   added: (at_ yellow_ball_1)
   goals met: 0 of 2
7. (pick yellow_ball_1 room_3)
   deleted: (at_ yellow_ball_1) (emptyhands) (objectinroom yellow_ball_1 room_3)
   added: (carrying yellow_ball_1)
   goals met: 0 of 2
8. (gotoroom room_3 room_1 red_door_1)
   deleted: (agentinroom room_3)
   added: (agentinroom room_1) (visited room_1)
   goals met: 0 of 2
9. (gotodoor blue_door_1 room_1 room_2)
   added: (at_ blue_door_1)
   goals met: 0 of 2
10. (toggle blue_door_1)
   deleted: (locked blue_door_1)
   goals met: 0 of 2
11. (gotoroom room_1 room_2 blue_door_1)
   deleted: (agentinroom room_1) (at_ blue_door_1)
   added: (agentinroom room_2) (visited room_2)
   goals met: 0 of 2
12. (gotoempty)
   added: (at_ empty)
   goals met: 0 of 2
13. (drop yellow_ball_1 room_2)
   deleted: (carrying yellow_ball_1) (at_ empty)
   added: (at_ yellow_ball_1) (emptyhands) (objectinroom yellow_ball_1 room_2)
   goals met: 0 of 2
14. (gotoobject blue_key_2 room_2)
   deleted: (at_ yellow_ball_1)
   added: (at_ blue_key_2)
   goals met: 0 of 2
15. (pick blue_key_2 room_2)
   deleted: (at_ blue_key_2) (emptyhands) (objectinroom blue_key_2 room_2)
   added: (carrying blue_key_2) (hold_0)
   goals met: 1 of 2
16. (gotoroom room_2 room_1 blue_door_1)
   deleted: (agentinroom room_2)
   added: (agentinroom room_1)
   goals met: 1 of 2
17. (gotoobject blue_key_1 room_1)
   added: (at_ blue_key_1)
   goals met: 2 of 2
